/* Напишите программу, которая на вход принимает одно число (N), 
а на выходе показывает все целые числа в промежутке от -N до */
/*int N=Convert.ToInt32(Console.ReadLine());
int M=-N;
while (M<=N)
{
    Console.WriteLine(M++);
}
Task2*/

Console.Clear();
int A=int.Parse(Console.ReadLine());
int LA = A%10;
Console.WriteLine(LA);
