//task1.Напишите программу, которая на вход принимает число и выдает его квадрат (умножение само на себя)

int number = 0;
string text = "";
text = Console.ReadLine();
number = Convert.ToInt32(text);
Console.WriteLine("Result:" + number*number);

// int number=Convert.ToInt32(Console.ReadLine());
//Console.WriteLine("Result:", number*number);